       IDENTIFICATION DIVISION.
       PROGRAM-ID. FEBSEQ.
       AUTHOR. GREG. MANLEY.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77  VALUESINFILE    PIC 9.

       PROCEDURE DIVISION.
           DISPLAY "HELLO".
