       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLO.
       PROCEDURE DIVISION.
              DISPLAY "HELLO, WORLD!".
       END PROGRAM HELLO.
       