       IDENTIFICATION DIVISION.
       PROGRAM-ID. OREGON.
       AUTHOR. GREG MANLEY.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77 V1 PIC 9 VALUE 9. 

       PROCEDURE DIVISION.
           DISPLAY "HELLO".
