       IDENTIFICATION DIVISION.
       PROGRAM-ID. OREGON.
       AUTHOR. GREG MANLEY.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77 V1 PIC 9 VALUE 9. 
       01 INTR PIC X(3).
       01 ANY-CHAR PIC X.
       77 DIF PIC X.

       PROCEDURE DIVISION.
           DISPLAY "./OREGON" AT LINE 1.
           DISPLAY "DO YOU NEED INSTRUCTIONS (YES/NO)" AT LINE 2.
           ACCEPT INTR AT LINE 3.

           IF INTR = "YES" THEN
               PERFORM INSTRUCTIONS
           END-IF

           DISPLAY " " AT LINE 1 ERASE SCREEN.

           PERFORM RIFLE_HOW_GOOD.

           STOP RUN.

       INSTRUCTIONS.
           DISPLAY "THIS PROGRAM SIMULATES A TRIP OVER THE O" AT LINE 5.
           DISPLAY "REGON TRAIL FROM" AT LINE 5 AT COLUMN 41.
           DISPLAY "INDEPENDENCE, MISSOURI TO OREGON CITY, O" AT LINE 6.
           DISPLAY "REGON IN 1847." AT LINE 6 AT COLUMN 41.
           DISPLAY "YOUR FAMILY OF FIVE WILL COVER THE 2040 " AT LINE 7.
           DISPLAY "MILE OREGON TRAIL" AT LINE 7 COLUMN 41.
           DISPLAY "IN 5-6 MONTHS --- IF YOU MAKE IT ALIVE." AT LINE 8.
           DISPLAY "YOU HAD SAVED $900 TO SPEND FOR THE TRI" AT LINE 10.
           DISPLAY "P, AND YOU'VE JUST" AT LINE 10 AT COLUMN 39.
           DISPLAY "   PAID $200 FOR A WAGON ." AT LINE 11.
           DISPLAY "YOU WILL NEED TO SPEND THE REST OF YOUR" AT LINE 12.
           DISPLAY " MONEY ON THE" AT LINE 12 AT COLUMN 39.
           DISPLAY "   FOLLOWING ITEMS:" AT LINE 13.
           DISPLAY "     OXEN - YOU CAN SPEED $200-$300 ON " AT LINE 15.
           DISPLAY " YOUR TEAM" AT LINE 15 AT COLUMN 39.
           DISPLAY "            THE MORE YOU SPEND, THE FAS" AT LINE 16.
           DISPLAY "TER YOU'LL GO" AT LINE 16 AT COLUMN 39.
           DISPLAY "               BECAUSE YOU'LL HAVE BET" AT LINE 17.
           DISPLAY "TER ANIMALS" AT LINE 17 AT COLUMN 39.
           DISPLAY "     FOOD - THE MORE YOU HAVE, THE LESS" AT LINE 18.
           DISPLAY " CHANCE THERE" AT LINE 18 AT COLUMN 40.
           DISPLAY "               IS OF GETTING SICK" AT LINE 19.
           DISPLAY "     AMMUNITION - $1 BUYS A BELT OF 50 " AT LINE 20.
           DISPLAY "BULLETS" AT LINE 20 AT COLUMN 40.
           DISPLAY "             YOU WILL NEED BULLETS FOR " AT LINE 21.
           DISPLAY "ATTACKS BY ANIMALS" AT 2140.
           DISPLAY "                AND BANDITS, AND FOR HU" AT LINE 22.
           DISPLAY "NTING FOOD" AT 2240.
           DISPLAY "     CLOTHING - THIS IS ESPECIALLY IMPO" AT LINE 23.
           DISPLAY "RTANT FOR THE COLD" AT 2340.
           DISPLAY "               WEATHER YOU WILL ENCOUNT" AT LINE 24.
           DISPLAY "ER WHEN CROSSING" AT 2440.
           DISPLAY "               THE MOUNTAINS" AT LINE 25.
           DISPLAY "     MISCELLANEOUS SUPPLIES - THIS INCL" AT LINE 27.
           DISPLAY "UDE MEDICINE AND" AT 2740
           DISPLAY "               OTHER THINGS YOU WILL NE" AT LINE 28.
           DISPLAY "ED FOR SICKNESS" AT 2840
           DISPLAY "               AND EMERGENCY REPAIRS" AT LINE 29.
           DISPLAY "YOU CAN SPEND ALL YOUR MONEY BEFORE YOU ST" AT 3101.
           DISPLAY "ART YOUR TRIP -" AT 3143.
           DISPLAY "OR YOU CAN SAVE SOME OF YOUR CASH TO SPEND" AT 3201.
           DISPLAY " AT FORTS ALONG" AT 3243.
           DISPLAY "THE WAY WHEN YOU RUN LOW. HOWEVER, ITEMS C" AT 3301.
           DISPLAY "OST MORE AT" AT 3343.
           DISPLAY "THE FORTS. YOU CAN ALSO GO HUNTING ALONG T" AT 3401.
           DISPLAY "HE WAY TO GET" AT 3443.
           DISPLAY "MORE FOOD." AT 3501.
           DISPLAY "WHENEVER YOU HAVE TO USE YOUR TRUSTY RIFLE" AT 3601.
           DISPLAY " ALONG THE WAY," AT 3643.
           DISPLAY "YOU WILL BE TOLD TO TYPE IN A WORD (ONE TH" AT 3701.
           DISPLAY "AT SOUNDS LIKE A" AT 3743.
           DISPLAY "GUN SHOT). THE FASTER YOU TYPE IN A WORD A" AT 3801.
           DISPLAY "ND HIT THE" AT 3843.
           DISPLAY """RETURN"" KEY, THE BETTER LUCK YOU'LL HAV" AT 3901.
           DISPLAY "E WITH YOUR GUN." AT 3941.
           DISPLAY "AT EACH TURN, ALL ITEMS ARE SHOWN IN DOLLA" AT 4101.
           DISPLAY "R AMOUNTS" AT 4143.
           DISPLAY "EXCEPT BULLETS" AT 4201.
           DISPLAY "WHEN ASKED TO ENTER MONEY AMOUNTS DON'T US" AT 4301.
           DISPLAY "E A ""$""." AT 4343.
           DISPLAY "GOOD LUCK!!!" AT 4501.
           ACCEPT ANY-CHAR AT 4601.
           
       RIFLE_HOW_GOOD.
           DISPLAY "HOW GOOD A SHOT ARE YOU WITH YOUR RIFLE?" AT 0101.
           DISPLAY "  (1) ACE MARKSMAN,  (2) GOOD SHOT,  (3) F" AT 0201.
           DISPLAY """IAR TO MIDDLIN'""" AT 0243.
           DISPLAY "         (4) NEED MORE PRACTICE,  (5) SHAK" AT 0301.
           DISPLAY "Y KNEES" AT 0343.
           DISPLAY "ENTER ONE OF THE ABOVE -- THE BETTER YOU C" AT 0401.
           DISPLAY "LAIM YOU ARE, THE" AT 0443.
           DISPLAY "FASTER YOU'LL HAVE TO BE WITH YOUR GUN TO " AT 0501.
           DISPLAY "BE SUCCESSFUL." AT 0543.
           ACCEPT DIF AT 0601.
