       IDENTIFICATION DIVISION.
       PROGRAM-ID. PITOTHENTH.
       AUTHOR. GREG. MANLEY.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77 DIGITS   PIC 99.       

       PROCEDURE DIVISION.
           ACCEPT DIGITS FROM COMMAND-LINE.
           DISPLAY DIGITS.
           GOBACK.
