       IDENTIFICATION DIVISION.
       PROGRAM-ID. RANDNUMGEN.
       AUTHOR. GREG. MANLEY.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
      * CONSTANTS
       77 RAN3-MSEED PIC 9(9)  COMPUTATIONAL VALUE 161803398.
       

       PROCEDURE DIVISION.
           DISPLAY "RANDOM NUMBER GENERATOR".
